In [15]:
import pandas as pd

### 행 또는 열 선택방법

In [30]:
data = {
    '이름' : ['홍길동', '임꺽정', '이순신'],
    '중간' : [40,60,100],
    '기말' : [60,50,95],
    '출석' : [8.5, 7.8,9.9]
}

In [31]:
df = pd.DataFrame(data)

In [32]:
df['주소'] = '경산'

In [33]:
df['생일'] = ['1999-01-02', '2010-09-17', '2015-01-18']

In [34]:
df.index = ['1', '2','3']

In [35]:
df

    이름   중간  기말   출석  주소          생일
1  홍길동   40  60  8.5  경산  1999-01-02
2  임꺽정   60  50  7.8  경산  2010-09-17
3  이순신  100  95  9.9  경산  2015-01-18

In [36]:
df.loc['1'] #행을 선택하기

이름           홍길동
중간            40
기말            60
출석           8.5
주소            경산
생일    1999-01-02
Name: 1, dtype: object

In [37]:
df2 = df.set_index(['이름'])

In [38]:
df2

      중간  기말   출석  주소          생일
이름
홍길동   40  60  8.5  경산  1999-01-02
임꺽정   60  50  7.8  경산  2010-09-17
이순신  100  95  9.9  경산  2015-01-18

In [39]:
df2.loc['임꺽정']

중간            60
기말            50
출석           7.8
주소            경산
생일    2010-09-17
Name: 임꺽정, dtype: object

In [40]:
df2

      중간  기말   출석  주소          생일
이름
홍길동   40  60  8.5  경산  1999-01-02
임꺽정   60  50  7.8  경산  2010-09-17
이순신  100  95  9.9  경산  2015-01-18

In [42]:
df2['홍길동':'임꺽정']

     중간  기말   출석  주소          생일
이름
홍길동  40  60  8.5  경산  1999-01-02
임꺽정  60  50  7.8  경산  2010-09-17

In [43]:
df2[0:1]

     중간  기말   출석  주소          생일
이름
홍길동  40  60  8.5  경산  1999-01-02

In [44]:
df

    이름   중간  기말   출석  주소          생일
1  홍길동   40  60  8.5  경산  1999-01-02
2  임꺽정   60  50  7.8  경산  2010-09-17
3  이순신  100  95  9.9  경산  2015-01-18

In [45]:
df.loc[ : , ['이름', '출석', '생일'] ]

    이름   출석          생일
1  홍길동  8.5  1999-01-02
2  임꺽정  7.8  2010-09-17
3  이순신  9.9  2015-01-18

In [46]:
df

    이름   중간  기말   출석  주소          생일
1  홍길동   40  60  8.5  경산  1999-01-02
2  임꺽정   60  50  7.8  경산  2010-09-17
3  이순신  100  95  9.9  경산  2015-01-18

In [47]:
df2

      중간  기말   출석  주소          생일
이름
홍길동   40  60  8.5  경산  1999-01-02
임꺽정   60  50  7.8  경산  2010-09-17
이순신  100  95  9.9  경산  2015-01-18

In [48]:
df2.loc['임꺽정', '생일']

'2010-09-17'

In [49]:
df2.loc['임꺽정']['생일']

'2010-09-17'

In [50]:
df2.at['임꺽정', '생일'] #loc에 비해서 at이 빠르다

'2010-09-17'

In [51]:
df

    이름   중간  기말   출석  주소          생일
1  홍길동   40  60  8.5  경산  1999-01-02
2  임꺽정   60  50  7.8  경산  2010-09-17
3  이순신  100  95  9.9  경산  2015-01-18

In [52]:
df.iloc[2]

이름           이순신
중간           100
기말            95
출석           9.9
주소            경산
생일    2015-01-18
Name: 3, dtype: object

In [53]:
df2

      중간  기말   출석  주소          생일
이름
홍길동   40  60  8.5  경산  1999-01-02
임꺽정   60  50  7.8  경산  2010-09-17
이순신  100  95  9.9  경산  2015-01-18

In [54]:
df2.iloc[2]

중간           100
기말            95
출석           9.9
주소            경산
생일    2015-01-18
Name: 이순신, dtype: object

In [55]:
df2.iloc[[0,1],[0,2,4]]

     중간   출석          생일
이름
홍길동  40  8.5  1999-01-02
임꺽정  60  7.8  2010-09-17

In [56]:
df2.iat[1,1]

50

### 열과 행을 삭제하는 방법

In [57]:
df

    이름   중간  기말   출석  주소          생일
1  홍길동   40  60  8.5  경산  1999-01-02
2  임꺽정   60  50  7.8  경산  2010-09-17
3  이순신  100  95  9.9  경산  2015-01-18

In [58]:
del df['주소'] #주소 열을 삭제

In [59]:
df

    이름   중간  기말   출석          생일
1  홍길동   40  60  8.5  1999-01-02
2  임꺽정   60  50  7.8  2010-09-17
3  이순신  100  95  9.9  2015-01-18

In [62]:
df.drop('생일', axis = 1) #drop은 del과 다르게 빼고 보여주는것

    이름   중간  기말   출석
1  홍길동   40  60  8.5
2  임꺽정   60  50  7.8
3  이순신  100  95  9.9

In [63]:
df #df는 그대로이다

    이름   중간  기말   출석          생일
1  홍길동   40  60  8.5  1999-01-02
2  임꺽정   60  50  7.8  2010-09-17
3  이순신  100  95  9.9  2015-01-18

In [66]:
df3 = df.drop('생일', axis = 1) #이렇게 사용

In [67]:
df3

    이름   중간  기말   출석
1  홍길동   40  60  8.5
2  임꺽정   60  50  7.8
3  이순신  100  95  9.9

In [68]:
df.drop('출석', axis = 1, inplace = True) #혹은 이렇게 사용

In [69]:
df

    이름   중간  기말          생일
1  홍길동   40  60  1999-01-02
2  임꺽정   60  50  2010-09-17
3  이순신  100  95  2015-01-18

In [72]:
# 행삭제
df.drop('2')

    이름   중간  기말          생일
1  홍길동   40  60  1999-01-02
3  이순신  100  95  2015-01-18

In [74]:
df

    이름   중간  기말          생일
1  홍길동   40  60  1999-01-02
2  임꺽정   60  50  2010-09-17
3  이순신  100  95  2015-01-18

In [76]:
df.drop('1',inplace = True)

In [77]:
df

    이름   중간  기말          생일
2  임꺽정   60  50  2010-09-17
3  이순신  100  95  2015-01-18